Revit 2026 API

# ElementGetTypeId Method

---

Returns the identifier of this element's type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GetTypeId()
```
```vb
Public Function GetTypeId As ElementId
```
```cpp
public:
ElementId^ GetTypeId()
```
```fsharp
member GetTypeId : unit -> ElementId
```

#### Return Value

ElementId The id of the element's type, or invalid element id if the element cannot have type assigned.

Some elements cannot have type assigned, in which case this method returns invalid element id.

#### Reference

Element Class

Autodesk.Revit.DB Namespace